---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.ElectricalAnalysis
source: html/dea2e785-d102-4388-ac2a-ef0db980beb9.htm
---
# Autodesk.Revit.DB.GroupTypeId.ElectricalAnalysis Property

Electrical Analysis.

## Syntax (C#)
```csharp
public static ForgeTypeId ElectricalAnalysis { get; }
```